InformationRegisters/ТорговоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ТорговоеОборудование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Comment>Параметры торгового оборудования.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель торгового оборудования.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассаККМ</Name>
					<Comment>Касса ККМ, которой соответствует данное оборудование.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Comment>Имя компьютера, к которому физически подключено данное устройство.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор подключаемого устройства.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/__ВидыЗаданийСервераПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>__ВидыЗаданийСервераПечати</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Накладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пречек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встречка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/__РаботаСТорговымОборудованиемСервер/Ext/Module.bsl
Функция ВернутьМодельОборудованияПоИдентификатору(Идентификатор=Неопределено) Экспорт
	
	Модель = Неопределено;
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегТО.Модель КАК Модель
	|ИЗ
	|	РегистрСведений.ТорговоеОборудование КАК РегТО
	|ГДЕ
	|	РегТО.Идентификатор = &Идентификатор
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Модель = Выборка.Модель;
	КонецЕсли;
	
	Возврат Модель;
	
КонецФункции	                   

Процедура ПечатьВстречки(Идентификатор, ТабличныйДокумент) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТорговоеОборудование.Параметры
	                      |ИЗ
	                      |	РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
	                      |ГДЕ
	                      |	ТорговоеОборудование.Идентификатор = &Идентификатор");
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Параметры = ЗначениеИзСтрокиВнутр(Выборка.Параметры);
		
		Параметры.Свойство("НазваниеПринтера", ТабличныйДокумент.ИмяПринтера);
		
		Параметры.Свойство("ПолеСверху", ТабличныйДокумент.ПолеСверху);
		Параметры.Свойство("ПолеСнизу", ТабличныйДокумент.ПолеСнизу);
		Параметры.Свойство("ПолеСлева", ТабличныйДокумент.ПолеСлева);
		Параметры.Свойство("ПолеСправа", ТабличныйДокумент.ПолеСправа);
		
		Параметры.Свойство("КоличествоКопий", ТабличныйДокумент.КоличествоЭкземпляров);
			
		ТабличныйДокумент.АвтоМасштаб = Ложь;
	    ТабличныйДокумент.МасштабПечати = 100;
		
		ТабличныйДокумент.Вывод = ИспользованиеВывода.Разрешить;
		
		__СерверПечатиСервер.Напечатать(ТабличныйДокумент, Перечисления.__ВидыЗаданийСервераПечати.Встречка);
	КонецЕсли;
	
	ТабличныйДокумент = Неопределено;
	
КонецПроцедуры // ПечатьВстречки()
